garyPenhook/PIC-Assembler/edc/PIC18F26Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T3CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T3CKIPPS" edc:nzwidth="8" edc:por="---10000" edc:_addr="0xEA2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3CKIPPS0" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS1" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS2" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS3" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKIPPS4" edc:mask="0x1" edc:name="T3CKIPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T3CKIPPS" edc:mask="0x1f" edc:name="T3CKIPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T3GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T3GPPS" edc:nzwidth="8" edc:por="---10000" edc:_addr="0xEA3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3GPPS0" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS1" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS2" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS3" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPPS4" edc:mask="0x1" edc:name="T3GPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T3GPPS" edc:mask="0x1f" edc:name="T3GPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T5CKIPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T5CKIPPS" edc:nzwidth="8" edc:por="---10010" edc:_addr="0xEA4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T5CKIPPS0" edc:mask="0x1" edc:name="T5CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS1" edc:mask="0x1" edc:name="T5CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS2" edc:mask="0x1" edc:name="T5CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS3" edc:mask="0x1" edc:name="T5CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5CKIPPS4" edc:mask="0x1" edc:name="T5CKIPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T5CKIPPS" edc:mask="0x1f" edc:name="T5CKIPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T5GPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T5GPPS" edc:nzwidth="8" edc:por="---01100" edc:_addr="0xEA5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T5GPPS0" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS1" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS2" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS3" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T5GPPS4" edc:mask="0x1" edc:name="T5GPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T5GPPS" edc:mask="0x1f" edc:name="T5GPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T2INPPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T2INPPS" edc:nzwidth="8" edc:por="---10011" edc:_addr="0xEA6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x3" edc:name="PORT" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2INPPS0" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS1" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS2" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS3" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2INPPS4" edc:mask="0x1" edc:name="T2INPPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2INPPS" edc:mask="0x1f" edc:name="T2INPPS" edc:nzwidth="0x5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
