garyPenhook/PIC-Assembler/edc/PIC18F26Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB4PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB4PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEEE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB4PPS0" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS1" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS2" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS3" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4PPS4" edc:mask="0x1" edc:name="RB4PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB5PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB5PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEEF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB5PPS0" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS1" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS2" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS3" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5PPS4" edc:mask="0x1" edc:name="RB5PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB6PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB6PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEF0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB6PPS0" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS1" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS2" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS3" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6PPS4" edc:mask="0x1" edc:name="RB6PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RB7PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RB7PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEF1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB7PPS0" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS1" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS2" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS3" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7PPS4" edc:mask="0x1" edc:name="RB7PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC0PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEF2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0PPS0" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS1" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS2" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS3" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC0PPS4" edc:mask="0x1" edc:name="RC0PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC1PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEF3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC1PPS0" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS1" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS2" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS3" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1PPS4" edc:mask="0x1" edc:name="RC1PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC2PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEF4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC2PPS0" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS1" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS2" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS3" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2PPS4" edc:mask="0x1" edc:name="RC2PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC3PPS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-xxK40-8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xEF5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC3PPS0" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS1" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS2" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS3" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3PPS4" edc:mask="0x1" edc:name="RC3PPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
