garyPenhook/PIC-Assembler/edc/PIC18F26Q10.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DAC1CON1" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="DAC1CON1" edc:nzwidth="8" edc:por="---xxxxx" edc:_modsrc="DOS-02567_dac_nbit_ctrl_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0xF2F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DAC1R" edc:mask="0x1f" edc:name="DAC1R" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="DAC1R0" edc:mask="0x1" edc:name="DAC1R0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1R1" edc:mask="0x1" edc:name="DAC1R0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1R2" edc:mask="0x1" edc:name="DAC1R0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1R3" edc:mask="0x1" edc:name="DAC1R0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1R4" edc:mask="0x1" edc:name="DAC1R0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-n--nn" edc:cname="CM2CON0" edc:desc="COMPARATOR CONTROL REGISTER 0" edc:impl="0xd3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0--00" edc:name="CM2CON0" edc:nzwidth="8" edc:por="00-0--00" edc:_modsrc="DOS-02728_cmp_rr_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xF30">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="C2SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C2HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="C2POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="C2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="CM2CON1" edc:desc="COMPARATOR CONTROL REGISTER 1" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="CM2CON1" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-02728_cmp_rr_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xF31">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2INTN" edc:desc="Comparator Interrupt on Negative going edge Enable bits" edc:mask="0x1" edc:name="C2INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2INTP" edc:desc="Comparator Interrupt on Positive going edge Enable bits" edc:mask="0x1" edc:name="C2INTP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CM2NCH" edc:desc="COMPARATOR INVERTING CHANNEL SELECT REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CM2NCH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02728_cmp_rr_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xF32">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NCH" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x7" edc:name="NCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="NCH0" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH1" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NCH2" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2NCH0" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C2NCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2NCH1" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C2NCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2NCH2" edc:desc="Comparator Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C2NCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CM2PCH" edc:desc="COMPARATOR NON-INVERTING CHANNEL SELECT REGISTER" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CM2PCH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02728_cmp_rr_ctrl_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xF33">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x7" edc:name="PCH" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="PCH0" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C2PCH0" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C2PCH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH1" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C2PCH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2PCH2" edc:desc="Comparator Non-Inverting Input Channel Select bits" edc:mask="0x1" edc:name="C2PCH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr-n--nn" edc:cname="CM1CON0" edc:desc="COMPARATOR CONTROL REGISTER 0" edc:impl="0xd3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0--00" edc:name="CM1CON0" edc:nzwidth="8" edc:por="00-0--00" edc:_modsrc="DOS-02728_cmp_rr_ctrl_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0xF34">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1SYNC" edc:desc="Comparator Output Synchronous Mode bit" edc:mask="0x1" edc:name="C1SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1HYS" edc:desc="Comparator Hysteresis Enable bit" edc:mask="0x1" edc:name="C1HYS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C1POL" edc:desc="Comparator Output Polarity Select bit" edc:mask="0x1" edc:name="C1POL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="Comparator Output bit" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C1EN" edc:desc="Comparator Enable bit" edc:mask="0x1" edc:name="C1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
