garyPenhook/PIC-Assembler/edc/PIC18F26Q10.PIC
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="SCANHADRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="SCANHADRU" edc:nzwidth="8" edc:por="--111111" edc:_modsrc="DOS-02730_dma_nvm_v2_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF49">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="HADR" edc:mask="0x3f" edc:name="HADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="HADR16" edc:mask="0x1" edc:name="HADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR17" edc:mask="0x1" edc:name="HADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR18" edc:mask="0x1" edc:name="HADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR19" edc:mask="0x1" edc:name="HADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR20" edc:mask="0x1" edc:name="HADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR21" edc:mask="0x1" edc:name="HADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANHADR" edc:mask="0x3f" edc:name="SCANHADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANHADR16" edc:mask="0x1" edc:name="SCANHADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR17" edc:mask="0x1" edc:name="SCANHADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR18" edc:mask="0x1" edc:name="SCANHADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR19" edc:mask="0x1" edc:name="SCANHADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR20" edc:mask="0x1" edc:name="SCANHADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR21" edc:mask="0x1" edc:name="SCANHADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnrrn-nn" edc:cname="SCANCON0" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00010-00" edc:name="SCANCON0" edc:nzwidth="8" edc:por="00010-00" edc:_modsrc="DOS-02730_dma_nvm_v2_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF4A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="INTM" edc:desc="" edc:mask="0x1" edc:name="INTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INVALID" edc:desc="" edc:mask="0x1" edc:name="INVALID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SCANMODE" edc:desc="" edc:mask="0x3" edc:name="SCANMODE" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SCANINTM" edc:desc="" edc:mask="0x1" edc:name="SCANINTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANINVALID" edc:desc="" edc:mask="0x1" edc:name="SCANINVALID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANBUSY" edc:desc="" edc:mask="0x1" edc:name="SCANBUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANGO" edc:desc="" edc:mask="0x1" edc:name="SCANGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANEN" edc:desc="" edc:mask="0x1" edc:name="SCANEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SCANMODE0" edc:desc="" edc:mask="0x1" edc:name="SCANMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANMODE1" edc:desc="" edc:mask="0x1" edc:name="SCANMODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="DABORT" edc:desc="" edc:mask="0x1" edc:name="DABORT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="SCANTRIG" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="SCANTRIG" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02730_dma_nvm_v2_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0xF4B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSEL" edc:desc="" edc:mask="0xf" edc:name="TSEL" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TSEL0" edc:desc="" edc:mask="0x1" edc:name="TSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEL1" edc:desc="" edc:mask="0x1" edc:name="TSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEL2" edc:desc="" edc:mask="0x1" edc:name="TSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TSEL3" edc:mask="0x1" edc:name="TSEL3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SCANTSEL" edc:desc="" edc:mask="0xf" edc:name="SCANTSEL" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SCANTSEL0" edc:desc="" edc:mask="0x1" edc:name="SCANTSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANTSEL1" edc:desc="" edc:mask="0x1" edc:name="SCANTSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCANTSEL2" edc:desc="" edc:mask="0x1" edc:name="SCANTSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANTSEL3" edc:desc="" edc:mask="0x1" edc:name="SCANTSEL3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nn---n" edc:cname="MDCON0" edc:desc="" edc:impl="0xb1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00---0" edc:name="MDCON0" edc:nzwidth="8" edc:por="0-00---0" edc:_modsrc="DOS-02566_txm_mod_v3_xxK40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xF4C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BIT" edc:desc="" edc:mask="0x1" edc:name="BIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OPOL" edc:desc="" edc:mask="0x1" edc:name="OPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDBIT" edc:desc="" edc:mask="0x1" edc:name="MDBIT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MDOPOL" edc:desc="" edc:mask="0x1" edc:name="MDOPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDOUT" edc:desc="" edc:mask="0x1" edc:name="MDOUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MDEN" edc:desc="" edc:mask="0x1" edc:name="MDEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn--nn" edc:cname="MDCON1" edc:desc="" edc:impl="0x33" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00--00" edc:name="MDCON1" edc:nzwidth="8" edc:por="--00--00" edc:_modsrc="DOS-02566_txm_mod_v3_xxK40_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0xF4D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLSYNC" edc:desc="" edc:mask="0x1" edc:name="CLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLPOL" edc:desc="" edc:mask="0x1" edc:name="CLPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CHSYNC" edc:desc="" edc:mask="0x1" edc:name="CHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHPOL" edc:desc="" edc:mask="0x1" edc:name="CHPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MDCLSYNC" edc:desc="" edc:mask="0x1" edc:name="MDCLSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCLPOL" edc:desc="" edc:mask="0x1" edc:name="MDCLPOL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MDCHSYNC" edc:desc="" edc:mask="0x1" edc:name="MDCHSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MDCHPOL" edc:desc="" edc:mask="0x1" edc:name="MDCHPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
