garyPenhook/PIC-Assembler/edc/PIC18F26Q10.PIC
        <edc:SFRDef edc:access="nnrrrrrr" edc:cname="SSP1STAT" edc:desc="MSSP1 STATUS REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1STAT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02545_mssp_v7_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF94">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BF" edc:desc="Buffer Full Status bit (Receive mode only)" edc:mask="0x1" edc:name="BF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UA" edc:desc="Update Address bit" edc:mask="0x1" edc:name="UA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R_nW" edc:desc="Read/Write Information bit" edc:mask="0x1" edc:name="R_nW" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S" edc:desc="Start bit" edc:mask="0x1" edc:name="S" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P" edc:desc="Stop bit" edc:mask="0x1" edc:name="P" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D_nA" edc:desc="Data/Address bit" edc:mask="0x1" edc:name="D_nA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:desc="SPI Clock Edge Select bit" edc:mask="0x1" edc:name="CKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:desc="SPI Data Input Sample Phase bit" edc:mask="0x1" edc:name="SMP" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="R_W" edc:desc="" edc:mask="0x1" edc:name="R_W" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="D_A" edc:desc="" edc:mask="0x1" edc:name="D_A" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nW" edc:desc="" edc:mask="0x1" edc:name="nW" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nA" edc:desc="" edc:mask="0x1" edc:name="nA" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nWRITE" edc:desc="" edc:mask="0x1" edc:name="nWRITE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="nADDRESS" edc:desc="" edc:mask="0x1" edc:name="nADDRESS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="READ_WRITE" edc:desc="" edc:mask="0x1" edc:name="READ_WRITE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DATA_ADDRESS" edc:desc="" edc:mask="0x1" edc:name="DATA_ADDRESS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="I2C_READ" edc:desc="" edc:mask="0x1" edc:name="I2C_READ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_START" edc:desc="" edc:mask="0x1" edc:name="I2C_START" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_STOP" edc:desc="" edc:mask="0x1" edc:name="I2C_STOP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_DAT" edc:desc="" edc:mask="0x1" edc:name="I2C_DAT" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="BF1" edc:desc="" edc:mask="0x1" edc:name="BF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UA1" edc:desc="" edc:mask="0x1" edc:name="UA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="R" edc:desc="" edc:mask="0x1" edc:name="R" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="START" edc:desc="" edc:mask="0x1" edc:name="START" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STOP" edc:desc="" edc:mask="0x1" edc:name="STOP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="D" edc:desc="" edc:mask="0x1" edc:name="D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKE1" edc:desc="" edc:mask="0x1" edc:name="CKE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SMP1" edc:desc="" edc:mask="0x1" edc:name="SMP1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RW" edc:desc="" edc:mask="0x1" edc:name="RW" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="START1" edc:desc="" edc:mask="0x1" edc:name="START1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STOP1" edc:desc="" edc:mask="0x1" edc:name="STOP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DA" edc:desc="" edc:mask="0x1" edc:name="DA" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RW1" edc:desc="" edc:mask="0x1" edc:name="RW1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_START1" edc:desc="" edc:mask="0x1" edc:name="I2C_START1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="I2C_STOP2" edc:desc="" edc:mask="0x1" edc:name="I2C_STOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DA1" edc:desc="" edc:mask="0x1" edc:name="DA1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.3">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2C_READ1" edc:desc="" edc:mask="0x1" edc:name="I2C_READ1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S2" edc:desc="" edc:mask="0x1" edc:name="S2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2" edc:desc="" edc:mask="0x1" edc:name="P2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DATA_ADDRESS1" edc:desc="" edc:mask="0x1" edc:name="DATA_ADDRESS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.4">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="READ_WRITE1" edc:desc="" edc:mask="0x1" edc:name="READ_WRITE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="D_A1" edc:desc="" edc:mask="0x1" edc:name="D_A1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.5">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="R_W1" edc:desc="" edc:mask="0x1" edc:name="R_W1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="D_nA1" edc:desc="" edc:mask="0x1" edc:name="D_nA1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.6">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="R_nW1" edc:desc="" edc:mask="0x1" edc:name="R_nW1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="I2C_DAT1" edc:desc="" edc:mask="0x1" edc:name="I2C_DAT1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.7">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nW2" edc:desc="" edc:mask="0x1" edc:name="nW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nA2" edc:desc="" edc:mask="0x1" edc:name="nA2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.8">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nWRITE1" edc:desc="" edc:mask="0x1" edc:name="nWRITE1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nADDRESS1" edc:desc="" edc:mask="0x1" edc:name="nADDRESS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SSP1CON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1CON1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02545_mssp_v7_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF95">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SSPM" edc:desc="Synchronous Serial Port Mode Select bits" edc:mask="0xf" edc:name="SSPM" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CKP" edc:desc="Clock Polarity Select bit" edc:mask="0x1" edc:name="CKP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPEN" edc:desc="Synchronous Serial Port Enable bit" edc:mask="0x1" edc:name="SSPEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPOV" edc:desc="Receive Overflow Indicator bit" edc:mask="0x1" edc:name="SSPOV" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WCOL" edc:desc="Write Collision Detect bit (Transmit mode only)" edc:mask="0x1" edc:name="WCOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SSPM0" edc:desc="" edc:mask="0x1" edc:name="SSPM0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM1" edc:desc="" edc:mask="0x1" edc:name="SSPM1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM2" edc:desc="" edc:mask="0x1" edc:name="SSPM2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM3" edc:desc="" edc:mask="0x1" edc:name="SSPM3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="SSPM01" edc:desc="" edc:mask="0x1" edc:name="SSPM01" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM11" edc:desc="" edc:mask="0x1" edc:name="SSPM11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM21" edc:desc="" edc:mask="0x1" edc:name="SSPM21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPM31" edc:desc="" edc:mask="0x1" edc:name="SSPM31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKP1" edc:desc="" edc:mask="0x1" edc:name="CKP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPEN1" edc:desc="" edc:mask="0x1" edc:name="SSPEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSPOV1" edc:desc="" edc:mask="0x1" edc:name="SSPOV1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WCOL1" edc:desc="" edc:mask="0x1" edc:name="WCOL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nrnnnnnn" edc:cname="SSP1CON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SSP1CON2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02545_mssp_v7_8Bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xF96">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEN" edc:desc="Start Condition Enable/Stretch Enable bit" edc:mask="0x1" edc:name="SEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RSEN" edc:desc="Repeated Start Condition Enable bit (Master mode only)" edc:mask="0x1" edc:name="RSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PEN" edc:desc="Stop Condition Enable bit (Master mode only)" edc:mask="0x1" edc:name="PEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCEN" edc:desc="Receive Enable bit (Master mode only)" edc:mask="0x1" edc:name="RCEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKEN" edc:desc="Acknowledge Sequence Enable bit (Master Receive mode only)" edc:mask="0x1" edc:name="ACKEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKDT" edc:desc="Acknowledge Data bit (Receive mode only)" edc:mask="0x1" edc:name="ACKDT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKSTAT" edc:desc="Acknowledge Status bit (Transmission only)" edc:mask="0x1" edc:name="ACKSTAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCEN" edc:desc="General Call Enable bit (Slave mode only)" edc:mask="0x1" edc:name="GCEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADMSK" edc:desc="" edc:mask="0x1f" edc:name="ADMSK" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADMSK1" edc:desc="" edc:mask="0x1" edc:name="ADMSK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMSK2" edc:desc="" edc:mask="0x1" edc:name="ADMSK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMSK3" edc:desc="" edc:mask="0x1" edc:name="ADMSK3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMSK4" edc:desc="" edc:mask="0x1" edc:name="ADMSK4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMSK5" edc:desc="" edc:mask="0x1" edc:name="ADMSK5" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="SEN1" edc:desc="" edc:mask="0x1" edc:name="SEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMSK11" edc:desc="" edc:mask="0x1" edc:name="ADMSK11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMSK21" edc:desc="" edc:mask="0x1" edc:name="ADMSK21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMSK31" edc:desc="" edc:mask="0x1" edc:name="ADMSK31" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKEN1" edc:desc="" edc:mask="0x1" edc:name="ACKEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKDT1" edc:desc="" edc:mask="0x1" edc:name="ACKDT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ACKSTAT1" edc:desc="" edc:mask="0x1" edc:name="ACKSTAT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GCEN1" edc:desc="" edc:mask="0x1" edc:name="GCEN1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEN1" edc:desc="" edc:mask="0x1" edc:name="RSEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PEN1" edc:desc="" edc:mask="0x1" edc:name="PEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCEN1" edc:desc="" edc:mask="0x1" edc:name="RCEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMSK41" edc:desc="" edc:mask="0x1" edc:name="ADMSK41" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMSK51" edc:desc="" edc:mask="0x1" edc:name="ADMSK51" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
