garyPenhook/PIC-Assembler/edc/PIC18F26Q10.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR3H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR3H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR3H" edc:mask="0xff" edc:name="TMR3H" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR3H0" edc:mask="0x1" edc:name="TMR3H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H1" edc:mask="0x1" edc:name="TMR3H1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H2" edc:mask="0x1" edc:name="TMR3H2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H3" edc:mask="0x1" edc:name="TMR3H3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H4" edc:mask="0x1" edc:name="TMR3H4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H5" edc:mask="0x1" edc:name="TMR3H5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H6" edc:mask="0x1" edc:name="TMR3H6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3H7" edc:mask="0x1" edc:name="TMR3H7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR38" edc:mask="0x1" edc:name="TMR38" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR39" edc:mask="0x1" edc:name="TMR39" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR310" edc:mask="0x1" edc:name="TMR310" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR311" edc:mask="0x1" edc:name="TMR311" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR312" edc:mask="0x1" edc:name="TMR312" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR313" edc:mask="0x1" edc:name="TMR313" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR314" edc:mask="0x1" edc:name="TMR314" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR315" edc:mask="0x1" edc:name="TMR315" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="T3CON" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uu-u0u" edc:name="T3CON" edc:nzwidth="8" edc:por="--00-000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC8">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR3CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD16" edc:desc="" edc:mask="0x1" edc:name="RD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOT_SYNC" edc:desc="" edc:mask="0x1" edc:name="NOT_SYNC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x3" edc:name="CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR3ON" edc:mask="0x1" edc:name="TMR3ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3RD16" edc:mask="0x1" edc:name="T3RD16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOT_T3SYNC" edc:mask="0x1" edc:name="NOT_T3SYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CKPS0" edc:desc="" edc:mask="0x1" edc:name="T3CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3CKPS1" edc:desc="" edc:mask="0x1" edc:name="T3CKPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nSYNC" edc:mask="0x1" edc:name="nSYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RD163" edc:desc="" edc:mask="0x1" edc:name="RD163" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nT3SYNC" edc:mask="0x1" edc:name="nT3SYNC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnr--" edc:cname="T3GCON" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuux--" edc:name="T3GCON" edc:nzwidth="8" edc:por="00000x--" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFC9">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR3GCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GVAL" edc:desc="" edc:mask="0x1" edc:name="GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GGO" edc:desc="" edc:mask="0x1" edc:name="GGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GSPM" edc:desc="" edc:mask="0x1" edc:name="GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GTM" edc:desc="" edc:mask="0x1" edc:name="GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GPOL" edc:desc="" edc:mask="0x1" edc:name="GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GE" edc:desc="" edc:mask="0x1" edc:name="GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="T3GVAL" edc:mask="0x1" edc:name="T3GVAL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GGO" edc:desc="" edc:mask="0x1" edc:name="T3GGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T3GSPM" edc:mask="0x1" edc:name="T3GSPM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GTM" edc:mask="0x1" edc:name="T3GTM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GPOL" edc:mask="0x1" edc:name="T3GPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GE" edc:mask="0x1" edc:name="T3GE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_DONE" edc:mask="0x1" edc:name="NOT_DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_T3DONE" edc:mask="0x1" edc:name="NOT_T3DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="GGO_nDONE" edc:mask="0x1" edc:name="GGO_nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="T3GGO_nDONE" edc:mask="0x1" edc:name="T3GGO_nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T3GATE" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T3GATE" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFCA">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR3GATE"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GSS" edc:mask="0x1f" edc:name="GSS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="GSS0" edc:mask="0x1" edc:name="GSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS1" edc:mask="0x1" edc:name="GSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS2" edc:mask="0x1" edc:name="GSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS3" edc:mask="0x1" edc:name="GSS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS4" edc:mask="0x1" edc:name="GSS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T3GSS0" edc:mask="0x1" edc:name="T3GSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GSS1" edc:mask="0x1" edc:name="T3GSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GSS2" edc:mask="0x1" edc:name="T3GSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GSS3" edc:mask="0x1" edc:name="T3GSS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3GSS4" edc:mask="0x1" edc:name="T3GSS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T3CLK" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="T3CLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFCB">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR3CLK"/>
            <edc:LegacyAlias edc:cname="PR3"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:mask="0x1f" edc:name="CS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T3CS0" edc:mask="0x1" edc:name="T3CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CS1" edc:mask="0x1" edc:name="T3CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CS2" edc:mask="0x1" edc:name="T3CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CS3" edc:mask="0x1" edc:name="T3CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3CS4" edc:mask="0x1" edc:name="T3CS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS4" edc:mask="0x1" edc:name="CS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR1" edc:desc="Joined 16-bit Timer" edc:name="TMR1" edc:nzwidth="0x10" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFCC"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR1L" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFCC">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1L" edc:mask="0xff" edc:name="TMR1L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR1L0" edc:mask="0x1" edc:name="TMR1L0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L1" edc:mask="0x1" edc:name="TMR1L1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L2" edc:mask="0x1" edc:name="TMR1L2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L3" edc:mask="0x1" edc:name="TMR1L3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L4" edc:mask="0x1" edc:name="TMR1L4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L5" edc:mask="0x1" edc:name="TMR1L5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L6" edc:mask="0x1" edc:name="TMR1L6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1L7" edc:mask="0x1" edc:name="TMR1L7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR10" edc:mask="0x1" edc:name="TMR10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR11" edc:mask="0x1" edc:name="TMR11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR12" edc:mask="0x1" edc:name="TMR12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR13" edc:mask="0x1" edc:name="TMR13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR14" edc:mask="0x1" edc:name="TMR14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR15" edc:mask="0x1" edc:name="TMR15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR16" edc:mask="0x1" edc:name="TMR16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR17" edc:mask="0x1" edc:name="TMR17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR1H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0xFCD">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1H" edc:mask="0xff" edc:name="TMR1H" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR1H0" edc:mask="0x1" edc:name="TMR1H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H1" edc:mask="0x1" edc:name="TMR1H1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H2" edc:mask="0x1" edc:name="TMR1H2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H3" edc:mask="0x1" edc:name="TMR1H3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H4" edc:mask="0x1" edc:name="TMR1H4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H5" edc:mask="0x1" edc:name="TMR1H5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H6" edc:mask="0x1" edc:name="TMR1H6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H7" edc:mask="0x1" edc:name="TMR1H7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR18" edc:mask="0x1" edc:name="TMR18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR19" edc:mask="0x1" edc:name="TMR19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR110" edc:mask="0x1" edc:name="TMR110" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR111" edc:mask="0x1" edc:name="TMR111" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR112" edc:mask="0x1" edc:name="TMR112" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR113" edc:mask="0x1" edc:name="TMR113" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR114" edc:mask="0x1" edc:name="TMR114" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR115" edc:mask="0x1" edc:name="TMR115" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
